import { PiDownloadSimpleBold } from "react-icons/pi";
import { Footer, Navbar } from "../../components/shared";
import ComponentHelmet from "../../utils/ComponentHelmet";
import "./Clubs.scss";

const articles = [
  {
    id: 1,
    title: "ЕРЕКШЕ ҚАЖЕТТІЛІГІ БАР БАЛАЛАРДЫҢ ҚАБІЛЕТТЕРІН ДАМЫТУ ЖОЛДАРЫ",
    excerpt: `
      <p><strong>Бүгінгі таңда қоғамдық өзгерістердің ауқымдылығы, күрделілігі білім беру саласына өзгерістер енгізуді талап етеді.</strong></p>
      <p>Осы талаптарды жүзеге асыруды қазіргі білім беру жүйесін дамыту үрдісінде жаңа оқыту үлгілеріне, мазмұнына, технологияларына, түрлері мен әдістеріне қатысты шығармашылық ізденістердің қарқындылығымен әрі көп түрлілігімен ерекшеленетінін мойындауға болады. Мұндай даму қоғамды ақпараттандыру технологиясын қарқынды дамыту аясында жүзеге асыру маңызды.</p>
      <p>Сондықтан негізінен осы мектептерде ерекше қажеттілігі бар балалардың қалыпты балалар мен оқыту технологиясын оқыту үдерісінде тиімді ұйымдастыру аса маңызды. Осы мақалада ерекше қажеттілігі бар балалардың қабілеттерін дамытудың ерекшеліктері, ерекше балалардың музыкалық қабілетінің дамуын психодиагностикалау және коррекциялық-дамытушылық жұмысты ұйымдастыру жолдары сипатталған.</p>
      <p>Мақалада автор инклюзивті оқыту технологиясының музыка сабақтарында пайдалану әдістемесі қарастырған және зерттеу жұмыстары арқылы инклюзивті оқыту технологиясының ғылыми теориялық тұрғыдан мағлұмат алып өз тәжірибесінде кеңінен қолдануға толық мүмкіндігі бар екенін дәлелдеп отыр. Соған қарай, автор инклюзивті оқыту технологиясының маңызының ерекше екендігін ескеріп бірнеше әдістемелік ұсыныстарды жасаған. Атап көрсетсек, олар келесідей:</p>
      <ul>
        <li>а) мектеп оқушыларына инклюзивті оқыту технологияларының әдістерін пайдаланылған сабақтарда олардың қызығушылығын біршама артады;</li>
        <li>б) мұғалімнің инклюзивті оқытудың әдістерін сабақта жиі қолданып отыруын қамтамасыз ету;</li>
        <li>в) білім беру ортасының ғылыми әрі оқу-әдістемелік тұрғыдан қамтамасыз етілуі;</li>
        <li>г) жаңалықтарды сәтті игеруге қажетті барлық ресурстарды дайындауы;</li>
        <li>е) музыка пәнінде инклюзивті оқыту технологиясының әдіс-тәсілдерін тиімді тақырыпты ашатындай әдістерді таңдап, аталған технологияның негізінде жүйелі ұйымдастырылса тақырып жан-жақты ашылады;</li>
        <li>ж) оқушыға музыкалық-эстетикалық тәрбиені беруді танымдық белсенділігі мен ойлауын дамыту бағытында жүргізілуі қажет. Әдемілік сезімі мен эмпатия, іс-әрекет етуге талпыну психологиялық денсаулыққа бағыттайды.</li>
        <li>з) оқушының музыкалық-эстетикалық әрекеті адамгершілік-эстетикалық дамуға мүмкіндік береді.</li>
      </ul>
      <p><strong>Түйін сөздер:</strong> қабілет, инклюзия, ерекше қажеттілігі бар бала, инклюзивті оқыту, музыка, музыкалық дыбыстар, музыкалық білім.</p>
    `,
    pdfUrl: "/pdfs/ЕРЕКШЕ ҚАЖЕТТІЛІГІ БАР БАЛАЛАРДЫҢ ҚАБІЛЕТТЕРІН ДАМЫТУ ЖОЛДАРЫ.pdf",
    size: "697 KB",
  },
  {
    id: 2,
    title: "ЖАСАНДЫ ИНТЕЛЛЕКТ ЕРЕКШЕ ҚАЖЕТТІЛІГІ БАР БАЛАЛАРДЫҢ СӨЙЛЕУ ТІЛІНІҢ БҰЗЫЛЫСТАРЫН АНЫҚТАУҒА АРНАЛҒАН ДИАГНОСТИКАЛЫҚ ТЕХНОЛОГИЯ РЕТІНДЕ",
    excerpt: `
    <p>Соңғы жылдары жасанды интеллект технологиясы қарқынды дамып келеді. Жасанды интеллект арнайы білім беру саласындағы ең құнды технологиялардың бірі ретінде анықталған.</p>
    <p>Мақалада шетел және отандық ғалымдардың білім беру саласында және де арнайы білім беру саласындағы жасанды интеллектті қолдану мүмкіндіктері мен бағыттары қарастырылған. Білім беру саласындағы жасанды интеллекттің жетістіктері зерделенді.</p>
    <p>Мақалада арнайы білім берудегі жасанды интеллект көмегімен сөйлеу тілінің бұзылыстарын анықтауға бағытталған зерттеу жұмысына теориялық талдау жасалды. Қазіргі кезде балаларда сөйлеу тілінің бұзылыстары жиі кездеседі.</p>
    <p>Шетел мемлекеттерінде сөйлеу тілінің бұзылыстарын жасанды интеллект арқылы диагностикалау бойынша зерттеу жұмыстары қарастырылған. Шетелдік тәжірибені зерделеу арқылы арнайы білім беру саласында жасанды интеллект көмегімен сөйлеу тілінің бұзылыстарын анықтау мүмкіндіктерін Қазақстан Республикасында қолдану аясын кеңейту маңыздылығы қаралды.</p>
    <p><strong>Түйінді сөздер:</strong> жасанды интеллект; білім беру; білім беру технологиялары; диагностика; сөйлеу тілінің бұзылыстары; арнайы білім беру.</p>
  `,
    pdfUrl: "/pdfs/ЖАСАНДЫ ИНТЕЛЛЕКТ ЕРЕКШЕ ҚАЖЕТТІЛІГІ БАР БАЛАЛАРДЫҢ СӨЙЛЕУ ТІЛІНІҢ БҰЗЫЛЫСТАРЫН АНЫҚТАУҒА АРНАЛҒАН ДИАГНОСТИКАЛЫҚ ТЕХНОЛОГИЯ РЕТІНДЕ.pdf",
    size: "558 KB",
  },
  {
    id: 3,
    title: "АУТИСТІК СПЕКТРЛІ БҰЗЫЛЫСТАРЫ БАР БАЛАЛАРДЫҢ АТА- АНАЛАРЫНА КӨРСЕТІЛЕТІН АҚПАРАТТЫҚ ЖƏНЕ ПСИХОЛОГИЯЛЫҚ ҚОЛДАУ КӨРСЕТУ ПРОЦЕССІ",
    excerpt: `
    <p>Бұл мақала аутистік спектрлі бұзылыстары бар балалармен жұмыс жасау барысында мамандар мен ата-аналардың өзара әрекеттесуіне арналған. Онда түзету процесінің негізгі кезеңдері, әдістері және олардың тиімділігі талқыланады.</p>
    <p>Аутистік спектрлі бұзылыстары бар балаларға көмек көрсету үшін дәрігерлер, психологтар және педагогтар арасындағы тығыз ынтымақтастықтың маңыздылығы ерекше атап өтіледі. Мақалада баланың әлеуметтік бейімделуіне ықпал ететін медициналық және психотерапевтік әдістер, сондай-ақ баланың өз бетінше әрекет ету дағдыларын дамытуға бағытталған педагогикалық тәсілдер қарастырылады.</p>
    <p>Ата-аналардың бала тәрбиесінде және оны оқытуда белсенді рөліне ерекше мән беріледі, өйткені олар мамандармен тығыз байланыс орнату арқылы баланың дамуына айтарлықтай әсер ете алады.</p>
    <p>Сонымен қатар, мақалада аутизмге байланысты кездесетін қиындықтар, соның ішінде тілдік және мінез-құлықтық мәселелер, сондай-ақ әлеуметтік оқшаулану проблемалары талданады. Бұл қиындықтарды шешу үшін кешенді тәсілдің қажеттілігі атап өтіледі, ол баланың әлеуметтік дағдыларын дамытуға және толыққанды өмірге бейімделуіне бағытталған.</p>
    <p><strong>Кілт сөздер:</strong> аутистік спектрлі бұзылыстары бар балалар, түзету әдістері, әлеуметтену, мамандардың өзара әрекеттесуі, педагогикалық тәсілдер.</p>
  `,
    pdfUrl: "/pdfs/АУТИСТІК СПЕКТРЛІ БҰЗЫЛЫСТАРЫ БАР БАЛАЛАРДЫҢ АТА- АНАЛАРЫНА КӨРСЕТІЛЕТІН АҚПАРАТТЫҚ ЖƏНЕ ПСИХОЛОГИЯЛЫҚ ҚОЛДАУ КӨРСЕТУ ПРОЦЕССІ.pdf",
    size: "481 KB",
  },
];

const Clubs = () => {
  return (
    <>
      <ComponentHelmet type="Мақалалар" />
      <Navbar />

      <div className="articles-container">
        {articles.map((article) => (
          <div key={article.id} className="article-card">
            <h2>{article.title}</h2>
            <div className="excerpt-title">Аңдатпа</div>
            <div
              className="excerpt-text"
              dangerouslySetInnerHTML={{ __html: article.excerpt }}
            />
            <div className="download-section">
              <span>Толығырақ:</span>
              <PiDownloadSimpleBold />
              <a href={article.pdfUrl} download>
                PDF жүктеу ({article.size})
              </a>
            </div>
          </div>
        ))}
      </div>

      <Footer />
    </>
  );
};

export default Clubs;
